
/*Даны дроби p 1 , p 2 ,  , p n ( p i , q i - натуральные). Составить программу, которая приводит эти дроби к общему
q 1 q 2
q n
знаменателю и упорядочивает их в порядке возрастания.*/

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        Scanner scn = new Scanner(System.in);










        /*
        System.out.println("Числитель первой дроби");
        int p = scn.nextInt();
        System.out.println("Знаменатель первой дроби");
        int q = scn.nextInt();

        System.out.println("Числитель второй дроби");
        int p2 = scn.nextInt();
        System.out.println("Знаменатель второй дроби");
        int q2 = scn.nextInt();

        System.out.println(p + " / " + q );
        System.out.println(p2 + " / " + q2);

        int nok = q * q2;
        System.out.println("наименьшнн общее кратное этих дробей = " + nok);

        int first = nok / q;
        System.out.println("Умножаем первую дробь на: " + first);
        int second = nok / q2;
        System.out.println("Умножаем второую дробь на: " + second);

        System.out.println(p * first + " / " + q * first);
        System.out.println(p2 * second + " / " + q2 * second);
*/



    }
}
